In [3]:
import pandas as pd

In [65]:
family = pd.read_csv("./Data/fgvc-aircraft-2013b/fgvc-aircraft-2013b/data/images_family_train.txt")

In [66]:
family

                   Image
0     1025794 Boeing 707
1     1340192 Boeing 707
2     0056978 Boeing 707
3     0698580 Boeing 707
4     0450014 Boeing 707
...                  ...
3329      1577680 Yak-42
3330      1826676 Yak-42
3331      0472681 Yak-42
3332      1597829 Yak-42
3333      0197891 Yak-42

[3334 rows x 1 columns]

In [36]:
family.columns

Index(['Image'], dtype='object')

In [37]:
family.iloc[0]

Image    1025794 Boeing 707
Name: 0, dtype: object

In [38]:
def return_family(element):
    return element[8:]

In [41]:
family_name = family["Image"].apply(return_family)

In [42]:
type(family_name)

pandas.core.series.Series

In [43]:
pd.concat([family, family_name], axis=1)

                   Image       Image
0     1025794 Boeing 707  Boeing 707
1     1340192 Boeing 707  Boeing 707
2     0056978 Boeing 707  Boeing 707
3     0698580 Boeing 707  Boeing 707
4     0450014 Boeing 707  Boeing 707
...                  ...         ...
3329      1577680 Yak-42      Yak-42
3330      1826676 Yak-42      Yak-42
3331      0472681 Yak-42      Yak-42
3332      1597829 Yak-42      Yak-42
3333      0197891 Yak-42      Yak-42

[3334 rows x 2 columns]

In [46]:
first_element = {"Image":["1340192"],
                "family":["Boeing 707"]}
a = pd.DataFrame(first_element, columns=["Image", "family" ])

In [47]:
a

     Image      family
0  1340192  Boeing 707

In [48]:
def return_family(element):
    return element[:7] + ".jpg"

In [49]:
rename(columns={"Image":"pene"})

                    pene
0     1025794 Boeing 707
1     1340192 Boeing 707
2     0056978 Boeing 707
3     0698580 Boeing 707
4     0450014 Boeing 707
...                  ...
3329      1577680 Yak-42
3330      1826676 Yak-42
3331      0472681 Yak-42
3332      1597829 Yak-42
3333      0197891 Yak-42

[3334 rows x 1 columns]

In [51]:
image_name = family["Image"].apply(return_family)

In [52]:
image_name.rename(columns={"Image":"pene"})

TypeError: rename() got an unexpected keyword argument 'columns'

In [55]:
image_name.to_frame(name="image")

            image
0     1025794.jpg
1     1340192.jpg
2     0056978.jpg
3     0698580.jpg
4     0450014.jpg
...           ...
3329  1577680.jpg
3330  1826676.jpg
3331  0472681.jpg
3332  1597829.jpg
3333  0197891.jpg

[3334 rows x 1 columns]

In [61]:
family_name = family_name.to_frame("family_name")

In [62]:
data = pd.concat([image_name, family_name], axis=1)

In [63]:
data

            Image family_name
0     1025794.jpg  Boeing 707
1     1340192.jpg  Boeing 707
2     0056978.jpg  Boeing 707
3     0698580.jpg  Boeing 707
4     0450014.jpg  Boeing 707
...           ...         ...
3329  1577680.jpg      Yak-42
3330  1826676.jpg      Yak-42
3331  0472681.jpg      Yak-42
3332  1597829.jpg      Yak-42
3333  0197891.jpg      Yak-42

[3334 rows x 2 columns]

In [69]:
def return_family(element):
    return element[8:]

def return_image(element):
    return element[:7] + ".jpg"

def family_creator(df):
    image_name = df["Image"].apply(return_image).to_frame("image")
    family_name =  df["Image"].apply(return_family).to_frame("family")
    return pd.concat([image_name, family_name], axis=1)

In [70]:
test = family_creator(family)

In [71]:
test

            image      family
0     1025794.jpg  Boeing 707
1     1340192.jpg  Boeing 707
2     0056978.jpg  Boeing 707
3     0698580.jpg  Boeing 707
4     0450014.jpg  Boeing 707
...           ...         ...
3329  1577680.jpg      Yak-42
3330  1826676.jpg      Yak-42
3331  0472681.jpg      Yak-42
3332  1597829.jpg      Yak-42
3333  0197891.jpg      Yak-42

[3334 rows x 2 columns]